[{"bio": ["Shelly is enthusiastic to start her third year at EPS. Prior to moving to Washington, she lived in Texas, California and Ohio working in administrative roles in both the high school and university levels. She loves doing outdoor adventures with her husband and knitting."], "name": "shelly_allen"}, {"bio": ["Elizabeth joined the Admissions Team and the College Counseling Office in June of 2015 after moving to Seattle from Columbus, Ohio. In both offices her primary responsibility is data management as well as event planning and support. In Admissions, she receives applications and guides potential EPS families through the Admissions process. Within College Counseling, she brings organizational management to enhance the efficiency and effectiveness of the process for our four college counselors as well as for students and their parents. Prior to coming to EPS, Elizabeth worked in childcare in addition to her work with individuals with developmental disabilities.", "When she is not on campus, Elizabeth can be found exploring the surrounding trails and her beloved Ballard neighborhood. She also enjoys trivia, knitting, and Ohio State football."], "name": "elizabeth_andersen"}, {"bio": ["Mike has worked as a Learning Specialist and Special Education Teacher in various schools around Seattle for ten years. Believing that every student is unique in their approach to learning, Mike works to help those students find their independence as they make their way through the challenges of academia.  Through techniques that work on executive functioning, stress reduction and self-advocacy, he sees his students grow on a daily basis.", "Prior to teaching, Mike received a Bachelor of Fine Arts and worked in museums around the country including The International Center of Photography, Site Santa Fe, Montclair Art Museum and The Bellevue Art Museum.  Between chasing his daughters around and working on his new house with his wife, he still finds pockets of time to stay active in the arts by volunteering at The Bellevue Art Museum and painting in his studio."], "name": "mike_anderson"}, {"bio": ["Amis has been proposing a wide variety of visual arts offerings to engage students of all skill levels at EPS since 2005.  Courses have included ceramics, drawing, painting, mixed media, graphic design, and filmmaking. Her philosophy is that art inspires and enriches our lives. It transcends languages and prejudices. It opens and expands our minds to the world around us and teaches us to see.", "<i>“In my classes, I strive to dispel the myth that only artistic people can authentically learn art skills. It’s a matter of providing the tools, some tips, and time. At EPS, in every art class each year, it is rewarding to witness students expanding their creative thinking and art skills through the process of simply creating artwork. It is in the process of doing where magic occurs. The hand-eye coordination and fine-motor skills that are developed by using the art materials and tools in specific ways translates into refined visual problem solving that can be applied across disciplines.”</i>"], "name": "amis_balcomb"}, {"bio": ["<i>“I have been so impressed by the commitment of faculty and staff to our students and families. I am really excited to be a part of the EPS community.”</i>"], "name": "vickie_baldwin"}, {"bio": ["Adrienne has been teaching high school mathematics since 1982, first in both public and private schools in Cape Town, South Africa, and later in Ontario, Canada. She moved to Bellevue in 2005, teaching math classes at Bellevue College before joining the Eastside Prep faculty in 2007. She is an avid runner, reader and lover of music. In her next life, she would like to be a blues guitarist or have even an ounce of musical talent. She loves being part of such a warm, caring community and is often referred to as “mom” by her students.", "<i>“Being an advisor allows me to get to know a group of students really well, follow their academic and social progress through school and form a closer connection than I would just having the student in class. It makes students comfortable knowing that there is one teacher constantly looking out for them.”</i>"], "name": "adrienne_behrmann"}, {"bio": ["Laurie was a software engineer before she decided her true passion was teaching.  Before coming to EPS, she taught software design at the college level and mathematics at the elementary and high school levels.  She was an EPS parent for two years before joining the faculty.  Besides creating lesson plans, she enjoys traveling, reading fiction, going for walks and bike rides, and spending time with her family. At EPS (as a faculty member) since 2007.", "<i>“Teaching at Eastside Prep is exciting. It’s the freedom to explore new ways of teaching; it’s interacting with fantastic faculty who are always willing to share ideas and help out; it’s being supported by administration willing to teach and to let you explore. It’s the opportunity to make a difference in people’s lives while also continuing to learn and grow myself.”</i>"], "name": "laurie_benaloh"}, {"bio": ["Doug taught PE courses when he first joined the EPS faculty in 2009 and the following year became the Director of Athletics. He continues to teach PE and coach teams while overseeing the entire EPS athletic program. Doug has been instrumental in expanding the athletic offerings at EPS and advancing our teams to more competitive leagues to allow for spirited rivalries with a growing number of schools. He previously taught physical education and coached basketball, soccer, track, and Ultimate Frisbee at The Northwest School in Seattle. In addition to athletics, Doug has studied law and is a lover of music; he has performed professionally as a vocalist throughout the Seattle area.", "<i>“I like EPS because of the freedom every member of the school community has to express and explore their own ideas.”</i>"], "name": "doug_blair"}, {"bio": ["Prior to joining the EPS faculty Daria taught sixth grade for 10 years at the Manhattan Country School in New York City. She moved to Seattle in 2008; the goal – and challenge – was establishing an EPS fifth grade program. Daria has also worked with Michael Cruz, on the middle school and all school productions for the last two year and currently sponsors the Open World Role Play club.", "Born in New York City, Daria spent much of her childhood in Palisades, NY and Nova Scotia, Canada, learning to love animals and nature, caring for everything from cows to ducks. Daria also raised and  trained her Morgan horse, training her as a hunter jumper as well as to pull a sulky. In her free time Daria enjoys playing with her Wire-Welsh terrier, Daphne, cooking, visiting her daughter, Samantha, who lives and studies psychology in  Austin, TX, gardening, practicing yoga, and camping.", "<i>“One of the most special elements of EPS is the commitment to community. Everyone is included; all invited, no one left out. EPS is a very safe and nurturing environment for everyone – from our youngest fifth graders to our seniors.”</i>", "On leave for the 2015-2016 school year."], "name": "daria_brandt"}, {"bio": ["Jonathan joined Eastside Prep in 2005 as the school’s first Director of Technology.  Jonathan spends a great deal of time keeping the school up to date with the latest technological changes, which has been no small endeavor over the past decade.  In addition to his teaching duties and independent study programs, Jonathan has implemented a laptop program in the Middle School, brought admissions and development databases online and written programs for the school that manage data around students and teaching.  He has overseen the technological needs of transitioning from ninety users to over 450 and from one building to ten.  Jonathan may be proudest of starting TEDxEastsidePrep, an annual conference that seeks to explore new ideas in education by bringing in speakers from outside the field of instruction. Prior to joining EPS, Jonathan spent four years teaching math and physics, chairing the upper school science department, and coaching volleyball and golf at the Bentley School in California.", "<i>“The agility and curiosity of the faculty around improving their craft is inspiring. They tackle new ideas with ease and use tried and true methods when those make the most sense.”</i>"], "name": "jonathan_briggs"}, {"bio": ["<i>“It’s the open mindedness about exposing students to activities such as yoga and flamenco that makes me appreciate Eastside Prep.”</i>"], "name": "vandana_chalana"}, {"bio": ["Roberta joined Eastside Prep in March 2012. She currently teaches Public Speaking and Stagecraft to both Middle and Upper Schoolers and works on all EPS productions. Roberta has spent the past fifteen years in Hollywood, producing television shows and designing lights and sets for theatres and she brings that field experience straight into the classroom.  When she’s not in the classroom, Roberta can be found walking around with a camera, documenting EPS life or creating a set or lighting design for an upcoming production.", "<i>“I continue to be inspired by students taking advantage of access to real-world experiences and technologies in the arts. I simply hand them the keys to their kingdom.”</i>"], "name": "roberta_christensen"}, {"bio": ["Prior to joining EPS in 2012, Robin worked as a field biologist before becoming more involved in her own children’s education. Through those personal experiences, Robin became fascinated with teaching and learning, especially with regards to kids with learning differences. Robin has held a number of teaching positions and spent seven years working with one of the Seattle area’s leading disability experts. She loves the outdoors and spending time with her husband and three children.", "<i>“EPS’s commitment to serving a diversity of learners in its community while maintaining a high level of academic rigor is awesome!”</i>"], "name": "robin_christy"}, {"bio": [], "name": "lena_chu"}, {"bio": ["Eric joined Eastside Prep in 2011 and has taught in both the Middle School and the Upper School. At EPS Eric teaches English and history, manages the Rock n Roll Club, and coaches the boys varsity basketball team. Prior to joining EPS, Eric spent three years teaching upper school history at Seattle Academy of Arts and Sciences. He believes that building strong relationships with students and relevance of class content are the keys to successful teaching. Eric was born in Sweden, but he has spent most of his life in the Seattle area. In his free time Eric enjoys writing and recording music, playing basketball, traveling, and spending time with his family."], "name": "eric_claesson"}, {"bio": ["Jess was born and raised in Seattle, WA but certainly has not stayed there for all of her adult life. After graduating from the UW, Jess moved to New York City where she performed in several independent theater projects and developed an interest in psychology. This interest turned into a passion that took her to the other side of the country to pursue her Masters of Social Work at USC. Her concentration in applying social work concepts to non-traditional environments lead her to explore how these practices can impact the learning environment. She joined EPS in 2010 and felt that, with its dedication to innovative thinking, it was the perfect place for her to set down some roots back in Seattle and hone her discipline. She believes in a holistic approach to academics which includes self-advocacy, mindfulness, emotional intelligence, and organization. When she is not teaching, Jess is an avid traveler (her most favorite recent trip being to Iceland), cook, reader, and enjoys spending time with her little daughter."], "name": "jess_claesson"}, {"bio": ["Derek brings years of experience in website design, video production, photography and marketing to Eastside Prep. As the school’s webmaster, Derek will assume responsibility for updating and improving the school’s main EPS website as well as smaller sites such as ARTS.eastsideprep.org and athletics.eastsideprep.org. He will also help to increase the school’s social media presence and will teach two Web Design classes. Derek moved his family to the Seattle area from Southern California for the opportunity to work at Eastside Prep and enjoy the many outdoor opportunities the Northwest offers.", "<i>“Eastside Prep has an excellent teaching environment that was apparent from my first meeting with faculty and staff. They truly do put the students and their education first.”</i>"], "name": "derek_clarke"}, {"bio": ["Prior to joining the EPS faculty, Anthony lived and worked in Washington D.C. After completing his graduate studies at Georgetown University, Anthony worked in the District as a political consultant and healthcare policy analyst. He moved back to Seattle two years ago to take a job on the Seattle Mayor’s staff. Most recently, Anthony started his own private tutoring business. He served students of all ages, including a number of EPS families.", "While he was born in San Francisco, Anthony moved to Washington at a very young age and grew up on the Eastside. He attended the Overlake School before heading to Santa Clara University for college. He played tennis competitively as a kid and has taught at a number of local clubs in the area.", "When he is not teaching, Anthony enjoys playing and watching sports of all kinds. He is an avid golfer and loves the Seahawks.", "<i>“I am truly excited to be joining the EPS community. I have found the staff’s commitment to their students to be inspiring. I feel like I am joining a tight-knit family. I cannot wait to get started.”</i>"], "name": "anthony_colello"}, {"bio": [], "name": "tom_cordova"}, {"bio": ["Kristina arrived to the Admissions team in 2011 with a background of working in the University of Portland Admissions Office for four years. During her short time at EPS she has gone from the Assistant, to an Admissions Associate, and to now the Associate Director of Admissions.  Kristina has further expanded upon the student ambassador program and has continued to revamp the admissions process to make it even more engaging and efficient.  When she is not at Eastside Prep, you might find Kristina coaching one of the EPS soccer teams, traveling and serving abroad, event coordinating a friend’s wedding, utilizing her whitewater river rafting experience, or spending quality time with her husband and family whether that be skiing, running, or playing a heated game of cards.", "<i>“Eastside Prep is a place where the faculty are passionate about what they teach and who they teach; the students are challenged in academics and in extracurricular programs, yet they know that it is ok to make mistakes and try new things; and the community genuinely cares about others and the world around them.  It is a place where faculty, staff, and students know that each day they will be challenged, that they are supported and that they are known.  Plus I would bet that they will chuckle at least a couple of times each day.”</i>"], "name": "kristina_dammrose"}, {"bio": ["Jake supports Middle School students with individualized instruction as part of the Guided Study Hall program. Jake has taught graduate courses in Special Education and Psychological Foundations to Education and worked as a school counselor for four years, two of those in an American school in Mexico. Jake credits those experiences with helping him create a holistic approach to working with students, drawing from counseling and academic best practices.", "Originally from Orange County, California, Jake is looking forward to making Seattle his new home. In his free time, Jake enjoys photography, discovering great restaurants, spending time outdoors, and traveling.", "<i>“I was drawn to the community at EPS and the emphasis on developing partnerships with students.”</i>"], "name": "jake_davis"}, {"bio": ["As EPS’s Academic Dean, Matt chairs the EPS Curriculum Committee and oversees the professional development process for faculty.  He devotes much of his time and attention to promoting the school’s approaches to integration (finding connections between different disciplines and classes); inquiry (using deep questions to drive learning); and experiential education (creating relevant, hands-on opportunities for students inside and outside the classroom).  Matt teaches Upper School courses in history and the social sciences. As an advocate for student choice he has proposed (and teaches) an array of electives in economics, media studies, urban planning, and political science. He is one of EPS’s four college counselors.  Matt is a former Division I collegiate swimmer and Masters swim coach.  He currently competes as a recreational triathlete, open-water swimmer, cyclist, and soccer player. Prior to joining EPS in 2007, Matt spent seven years teaching (history, political science, English, and media studies) and working as a small school facilitator at Edmonds-Woodway High School.", "<i>“My advisees know that our time together is an opportunity to relax with a smaller group of people that they know well. Most importantly they know that they have an advocate in me, and whenever needed I am there to help them process and figure out their lives at EPS and beyond.”</i>"], "name": "matt_delaney"}, {"bio": ["Katie hails originally from New Orleans but has been a Seattle resident since 1997 and has been teaching at EPS since 2009. Prior to teaching she worked as a fisheries biologist, which took her to such exotic locales as the middle of the Bering Sea. In addition to teaching Middle School Science you can find her helping out with the Middle School volleyball team.  One of the highlights of her year is the 4H Cat Costume Contest at the Puyallup Fair (attending as a spectator, not a participant!). When she’s not admiring cats dressed up in funny costumes, Katie enjoys spending time with her family.", "<i>“I love the fearless enthusiasm of the students at Eastside Prep. I appreciate that this is a learning environment where the students clearly feel safe taking risks in the classroom.”</i>"], "name": "katie_dodd"}, {"bio": ["Ian credits his lengthy efforts to complete his own education with shaping his fundamental belief in the power and necessity of an education.  It also inspires him to pass that learning on to the next generation. Ian has been at Eastside Prep since 2014 and before that he most recently taught English and drama at a local public school.  He is passionate about getting students to not only think for themselves, but to express those ideas in creative and meaningful ways.  Ian enjoys the theater, poetry slams, and literature readings, He studied for a year at the University of London, where his passion for all things Shakespeare took root.  He is also a world-ranked pinball player and participates in local tournaments.", "<i>“I am thrilled to be joining the EPS faculty and share its philosophy that abstract and critical thinking are essential not only for a person’s career, but also help dramatically improve the quality of life for the student’s community and world.”</i>"], "name": "ian_duncan"}, {"bio": ["Ginger arrived to EPS in the fall of 2014 and worked quickly to build upon the foundation of the music program. With enthusiastic student interest, the support of EPS and her colleague Mr. Todd Nystrom, the music program was expanded to include an additional level of both instrumental music and choir. ", "Ginger graduated from the University of Puget Sound on scholarships for academics and music, studying voice in Vienna Austria as a highlight of her training. She has performed with many ensembles in the greater Seattle area, and has been a featured soloist with Seattle Pro Musica, The Redmond Chorale, the University of Washington Chamber Singers and Summer Chorale. In addition to her responsibilities at EPS, Ginger is the director of the Concert Choir of Bellevue Youth Choirs. Ginger is a member of the American Choral Directors Association, the Washington State Music Educators Association and firmly believes that music is an integral part of education and humanity, and will always make your day better. ", "<i>“The opportunity for creativity and growth at EPS seems to be present everywhere, through supportive administration, faculty, staff and students.”</i>"], "name": "ginger_ellingson"}, {"bio": ["Steve began his teaching career as a Teaching Assistant during grad school.  After originally thinking he would teach at the college level, Steve switched to Upper School teaching in order to have a greater opportunity to connect with students.  Steve looks forward to the ability to impact the lives of EPS students both inside and outside the classroom through his roles as teacher, advisor and coach.  When not busy at school, Steve enjoys running, camping, climbing, and hiking with his girlfriend Phoebe and his Rhodesian Ridgeback Rita.", "<i>“I was drawn to Eastside Prep by the importance that EPS places on creating genuine relationships amongst the members of the school.  That collegiality seems to create a passionate atmosphere for learning and discovering.”</i>"], "name": "steve_fassino"}, {"bio": ["Emma came to EPS in 2011 after five years teaching in a Pennsylvania boarding school where she was also a dorm parent.  She has lived in Spain as a college student, as a graduate student, and has returned for summer professional study of both dance and language.  Emma’s teaching career has included national and local conference presentations on culture and pedagogy in the classroom. At EPS Emma has chaperoned multiple Latin American EBC trips, and assists in facilitating the Spanish Study Buddies Program.", "Aside from language, Emma brings her flamenco experience to the EPS physical education curriculum. She has studied at Spain’s top studios and with many of the most notable flamencos here in the States. She currently performs locally with La Pena Flamenca de Seattle and Cuadro Azahares, and she began teaching flamenco in 2007.  Outside of EPS, she directs the nonprofit Espacio de Arte which promotes Hispanic fine and performing arts. Emma lives with her husband, a flamenco guitarist, and her son in her native Seattle."], "name": "emma_ferguson"}, {"bio": [], "name": "javier_fernandez"}, {"bio": ["Patricia’s brought her eighteen years of teaching experience in both her native Argentina and the US to Eastside Prep in 2007. Patricia is passionate about learning, teaching, and traveling. Her goal at EPS is to contribute to the growth of the Spanish language discipline by helping her students develop their linguistic skills and cultural awareness, and by integrating the visual arts into the Spanish language classroom. When she’s not teaching, Patricia also enjoys taking classes, reading and exploring her creative side through music and art.", "<i>“My students come to the classroom eager to learn more not just about the language, but also about Spanish-speaking cultures and the world at large. Their curiosity and challenging questions encourage me to ask and find answers to questions I had not thought of before. Whether we are in the classroom, or abroad on a school trip, time flies.”</i>"], "name": "patricia_ferreyra"}, {"bio": ["Dave comes to EPS with eighteen years of teaching experience, seventeen of those years at Forest Ridge Middle School. Dave enjoys attending lectures and conferences to help him find new ideas and topics to present in class and believes that listening to his students’ interests helps his teaching remain relevant.", "When he’s not at school, David might be found at a boxing workout, backpacking with his family, or doing volunteer trail maintenance.", "<i>“Former students, former parents and friends of colleagues kept saying great things about EPS. I kept checking the website and liked what I was reading. Teacher-generated curriculum, student-inspired clubs and classes, and kids who liked their school were all the tell-tale signs that something great was going on and I needed to be part of it.”</i>"], "name": "david_fierce"}, {"bio": ["Since joining Eastside Prep in 2007, Lauren has watched enrollment grow by 150%.  She has moved from Assistant to Associate to Director of Admissions and has had a key role in overhauling the admissions data management process, spearheading the student ambassador program, restructuring visit days, revamping communication plans, and increasing marketing efforts. By joining the college counseling team, Lauren now has the unique perspective of the journey a student takes when they arrive to EPS and who they are as they graduate. Lauren came to EPS from a background in youth program and non-profit management and her experience with youth and families spans multiple educational and recreational settings. Prior to EPS, she spent three years as the Director of Youth Programs and Associate Director of Friends Outside, a social services agency in California that served youth impacted by parental incarceration. In addition to her work in admissions and college counseling, Lauren also started the Upper School women’s volleyball program.", "<i>“What I enjoy most about the EPS community is the strength of our relationships with each other. There is strong leadership, passionate teaching, and the students are known. This is a school full of thinkers, from the students to the administration, and there is an inherent and contagious energy here because of that.”</i>"], "name": "lauren_formo"}, {"bio": ["Lisa is brand new to the EPS family this year! In fact, she’s brand new to the Seattle- area. She’s excited to be working as the Administrative Assistant to Student Life and looks forward to meeting each student, parent, and faculty member that’s part of the EPS family. Lisa is no stranger to private schools having taught Theatre at Elgin Academy in Chicago for two years she found comfort in small class sizes and reveled in an excited community of parents assisting the educational advancement of students. However, that wasn’t all she did in Chicago. In the past couple years Lisa had the pleasure of working in the Catering and Event Planning profession. Having worked with the likes of the Chicago Cubs (Boooo! She’s a Chicago White Sox fan!) and the Chicago Blackhawks (yeay!) she decided to make a change and head West. Somehow, this has led her to EPS!", "As a self-proclaimed “foodie” Lisa could use some restaurant recommendations and she can’t wait to hear back from all of you!"], "name": "lisa_frystak"}, {"bio": ["Joe joined Eastside Prep in 2015 to teach Precalculus, Calculus, and Statistics. After getting a BS in Mechanical Engineering from Purdue, Joe worked as an engineer and believes his engineering experiences are invaluable resources that will help students connect the subject matter to the real world. After working for five years as an engineer, Joe switched to high school mathematics and also completed a Ph.D. in mathematics education. He’s taught for twenty-nine years at the high school and college level.", "Joe has been married to his wife for thirty-four years and has three children and seven grandchildren. His hobbies include board games and cards but he’s also into the outdoors and fitness.", "<i>“The small class sizes and the emphasis on teacher ownership of course content and many other good things I saw on Eastside Prep’s website drew me to apply for a position here. My visit on campus, getting to meet the students and faculty sealed the deal!”</i>"], "name": "joe_garrison"}, {"bio": [], "name": "victor_guevara"}, {"bio": ["Bart has served as the Upper School Head since 2008. In that time, the Upper School has grown from twenty-six students, seven faculty and only eleven courses to over 180 students, over forty-five faculty members and over 140 course offerings. Bart has overseen many changes to the Upper School program including the op¬portunity for seniors to design their own course of study through Independent Study options and the requirement that they complete a self-designed, multidisciplinary project. He is also one of our four college counselors at Eastside Prep. Bart came to EPS from Collegiate School in Richmond, Virginia, where he served as Assistant Head of the Upper School. At Collegiate, he was responsible for college counseling, mentoring teachers, teaching math, and coaching golf and baseball. Before moving to Col¬legiate, Bart spent eight years at Pingree School in Massachusetts where he was Director of College Counseling, taught math, and coached baseball. Bart previously worked as a college admissions of¬ficer at Middlebury College in Vermont.", "<i>“I most appreciate the shared sense of mission held by this community. Teachers and administrators are each willing to make any changes here if they believe those changes will best serve our students, even when those changes require harder work. Parents believe in the school’s mission and do much to support it as well.”</i>"], "name": "bart_gummere"}, {"bio": ["Tina brings to EPS over ten years of general office administration, primarily assisting senior executives in corporate sales &#038; marketing. As the school’s Administrative Services Director since 2005, Tina provides support to the Head of School and the Board of Trustees. She is also the managing editor of Inspire, Eastside Prep’s biannual magazine. Outside of work, she likes to spend time with family–traveling and exploring new places. Tina also enjoys reading books and working on her latest beading project.", "<i>“One of the things I like about EPS is the conscious effort to make each student successful—to see how far an individual can go based on his/her skills and background. This is the same spirit fostered with the faculty and staff – each of us is constantly and consistently challenged to get better at what we do.”</i>"], "name": "cristina_(tina)_hadden"}, {"bio": ["Paul joined EPS as a Middle School history teacher in 2009 before becoming the Director of Student Life in 2014. As Director of Student Life Paul guides several student-centered programs including Senior Projects, EBC Week, Service Learning, and EPSummer, as well as all the social activities and clubs that make EPS so dynamic. Prior to coming to EPS Paul spent two years teaching history in Hawaii, and one year teaching English in Madrid, Spain.  Paul has always been committed to service both locally and globally, and to that end he has volunteered in Prasat, Thailand, worked as a humanitarian in Mexico, served in Washington State Search and Rescue, and coached and mentored numerous young people. Paul is the father of three boys, and has many hobbies including writing and pottery.", "<i>“I love everything about Eastside Prep! But what I love most is working with our exceptional students – they are the best!”</i>"], "name": "paul_hagen"}, {"bio": ["Melissa came to the EPS in 2006 from coaching at Lakeside and the Lake Washington Rowing Club. She teaches Middle and Upper School physical education and coaches the growing crew team that she founded her first year here. Melissa is a US Rowing Level II certified coach.", "<i>“I am constantly impressed by the students, parents, faculty and staff at Eastside Prep. This is such a great community! The experiential nature of our program allows us to see how students employ their knowledge in a variety of situations, and this is really brought to life through our advisory program, service learning, and after school sports and activities.”</i>"], "name": "melissa_hayes"}, {"bio": ["Sarah previously worked as a classroom teacher and technology integration specialists in grades four through seven, as well as a summer camp and after school program director at Evergreen Academy in Bothell for over five years. She has also worked as a tutor in reading/writing, math, science, and study skills for more than eight years. Sarah first came to EPS as a long term substitute in Middle School Science and Upper School Guided Study Hall from January through June 2013, and she joined the EPS community full time in September 2013 as the Student Safety Coordinator.  Sarah then joined the faculty full time in 2014, teaching Middle School science and math.  In her free time, Sarah enjoys arts and crafts, gardening, playing tennis, and spending time with her two Chihuahuas, Champ and Gwen, as well as her pet hedgehog, Elphaba."], "name": "sarah_hollingshead"}, {"bio": ["Brian (“Hutch”) joined Eastside Prep in 2014 as its Director of Fine and Performing Arts. Promoting the arts at EPS will be a major part of that role and he’ll also teach a few visual arts classes.  Hutch grew up on the west coast but took a circuitous route before settling in the Pacific Northwest a few years ago – he has taught art in Thailand and in Massachusetts. Hutch taught art and design at an independent school in Tacoma prior to his start at Eastside Prep.  “I was particularly drawn to EPS because of the collaborative nature of the community and the opportunity to become a leader in the arts.  I’m very excited to work with the arts faculty to continue to build the fine and performing arts programs.”  Hutch lives with his wife, young daughter and a grey hound named Gene Parmesan.  In his spare time, Hutch enjoys working on his letterpress, painting, and spending a bit of time at a maker space playing with the laser cutter.", "<i>“These experiences have helped develop in me a passion for the Arts, a spirit of collaboration and creativity, and a strong desire to be part of a community.  I love serving the community at EPS with these gifts!”</i>"], "name": "brian_hutcheson"}, {"bio": ["Charles is married and has a son who was born in Aguascalientes, Mexico. They have a home in Mexico as well. He loves hot spicy food and playing the drums."], "name": "charles_jennings"}, {"bio": ["Stephen is new to the Seattle area, joining the faculty of EPS for the 2012-2013 school year. He spent three years teaching high school English in a small school district outside of Austin, Texas, and one year teaching high school English in San Antonio, Texas. He has coordinated the gifted and talented program for his district, been an advanced placement instructor, and sponsored two literary magazines. Stephen was drawn to the Pacific Northwest by its close proximity to great hiking, fishing and camping. In addition to reading and writing he enjoys traveling, playing guitar, and photography."], "name": "stephen_keedy"}, {"bio": ["David Kelly-Hedrick joined Eastside Prep to teach seventh and eighth grade English. He comes from a long career in education and community work that includes time developing leadership and service programs at the Seattle YMCA.", "David and his wife have three kids, one in college and two in high school. He loves hiking, running, swimming, and just wandering through the city or mountains.", "<i>“I am interested in the ways that groups of people young and old–like those at EPS–are creating new and vibrant culture in our world. I look forward to reading and writing and exploring the world of literature with my students.”</i>"], "name": "david_kelly-hedrick"}, {"bio": ["Adam joined Eastside Prep to teach Physics and Advanced Physics. He discovered his love for teaching while leading undergrad classes and labs as a graduate student at Cornell. After Cornell, he taught upper school physics and math at Lakeside School for seven years before he switched to teaching younger students. He has worked on integrated curricula before and is excited to work within the EPS mission.", "Adam loves live music, dancing, and philosophical fiction.", "<i>“Throughout my teaching career I have been refining my understanding of what is important to me in education. The culture and structure of EPS seem ideal to foster the kind of engagement and active and applied learning that I value.”</i>"], "name": "adam_kruger"}, {"bio": ["Elin has been teaching at Eastside Prep since 2007. She taught Spanish for the first 5 years, and now she teaches Science and PE. In addition to her regular duties at EPS, Elin enjoys the Science field trips she takes with the fifth-graders and the school’s environmental/outdoor education excursions. She also likes connecting with her students and colleagues, and being involved in the daily life of the strong EPS community. When not teaching Science or PE, you can find Elin on the Ultimate Frisbee field coaching the Eastside Prep team.", "<i>“I like how I have had the opportunity to work with students in a variety of settings: in the Science lab, in the Spanish room, on the Ultimate field, in the woods at camp, on the beach by a lake, around the campfire, on a sailboat in the San Juan Islands, and in the cloud forests and tide-pools of Costa Rica. Because of these opportunities I have gotten to know the kids not only as pupils in a classroom, but as whole people.”</i>"], "name": "elin_kuffner"}, {"bio": ["After teaching history and serving as the Director of Student Activities for eleven years in Manhattan, Chris moved to the west coast to join the EPS faculty in 2014-2015.  Chris has presented at several state, regional and national student leadership conferences and believes that “teenagers are way more prepared to lead the way than most adults realize.”  Student government is another passion for Chris and he looks forward to advising EPS students in this area.  Chris enjoys woodworking, golf, biking, running and reading, and is looking forward to becoming familiar with the Pacific Northwest (he bought an umbrella).", "<i>“I believe strongly that we must act boldly and take personal risks to grow personally and professionally.  I believe EPS represents a chance for me to be a finer version of myself.”</i>"], "name": "chris_legrand"}, {"bio": ["Allison has been at EPS since 2007. She is a Kirkland native who came to her career in teaching by way of the East Coast publishing industry; she used to edit and market children’s books, until she realized teachers and kids are way more fun than publishers. When she’s not immersed in a book herself, Allison can usually be found tending her garden, cooking, or hanging out with her family and playing with her young son.", "<i>“We have built a school that encourages innovative and critical thinking not only in our students, but in the faculty and administration as well. If we want to help students become responsible citizens, we know we have to model that behavior and give our students the freedom to succeed, knowing we trust them to make good decisions, just as we trust one another.”</i>", "On leave for the 2015-2016 school year."], "name": "allison_luhrs"}, {"bio": ["Dr. Macaluso was originally retained by the Eastside Preparatory School Board of Trustees in August 2002, to guide them in the development of the school’s mission and vision. She served in a consulting role until March, 2003, when she accepted the position as Head of School.  Under Dr. Macaluso’s guidance, Eastside Prep has grown from 16 students to almost 300, the campus has expanded to encompass 10 buildings, a major capital campaign to build the Levinger-Poole Commons has been undertaken and completed and Eastside Prep has solidified its reputation as a college preparatory school with a rigorous academic program. All this, while keeping our focus on the most important component of our school – the students. Previously, Dr. Macaluso spent nearly thirty years in independent schools  and university education, serving as teacher, college counselor, Upper School Director, President, and Head of School in three different schools. In 1999, Dr. Macaluso retired from the headship of Lakeside School in Seattle, after a successful seven-year tenure that included completion of a $50mm capital campaign, construction of three new buildings, quadrupling of the school’s endowment, and programs designed to enhance the quality of teaching.  Lakeside’s Macaluso Endowment for Leadership Development was established in 1999; she is the recipient of the 2006 Willard Wright Award for Distinguished Service, given by the Lakeside Board of Trustees to acknowledge extraordinary service to the school.", "When she isn’t raising money, preparing to teach a class, reading philosophy, or watching movies, Dr. Macaluso loves spending weekends with her Yorkies, Lucy and Ethel, walking and chasing birds in Port Townsend at her weekend cabin.", "<i>“I’ve thought about this for a long time – and I’ve tested it personally. There isn’t anything one can do with one’s life that is more important, more valuable, or longer lasting than teaching. I’m reminded of that every day when fifth graders and Upper School seniors walk past my window. In only eight years, each student is transformed. Think about the impact over the course of a lifetime.”</i>"], "name": "terry_macaluso"}, {"bio": ["Roger came to Eastside Prep in 2014 and handles the day-to-day network and server administration as well as providing technical support for students and staff. He’ll also be teaching the Middle School Make class and the Upper School Physical Meets Digital course. After originally pursuing an education in chemistry, Roger switched to network administration in order to combine his passion for technology and the opportunity to teach others in a hands-on environment.  Roger helps run an online toy store and is an avid PC and console video game player/collector. He’s also a huge fan of crab fishing as crustaceans fascinate him, both scientifically and culinarily.", "<i>“The sense of community I got stepping through the EPS door and seeing the interactions between the staff educators, and students made me realize I was somewhere special.”</i>"], "name": "roger_mack"}, {"bio": ["Bess has taught in the Peace Corp, on the East Coast, and at SAAS. She has also worked in the documentary film industry and as a public interest attorney. While Bess has found her life’s work in teaching, her experience in other fields allows her to bring a broader perspective into the classroom.", "When not teaching, Bess runs marathons, bakes, reads, and occasionally binge watches TV shows. ", "<i>“Walking around campus, it felt clear that not only did the students, faculty, and staff know each other, but that they were kind to one another, that there was a sense of taking care of the place and of each other.”</i>"], "name": "bess_mckinney"}, {"bio": ["<i>“People at EPS are incredibly competent, focused, open, accessible and have a sense of humor – not something one should take for granted in a school setting.” There’s a definite “can do” attitude at work here, and things move intentionally and fast.”</i>"], "name": "gunnar_mein"}, {"bio": ["Karen Mills is an original employee of Eastside Prep, having been hired by the pioneering founders of the school in January 2003 after completing her Masters in Library and Information Science. She served initially as the main administrative support for the head of school and board of trustees while also acting as the school’s librarian, collecting materials and developing systems for what would become the EPS Library. She assumed the role of Director of Admissions for the 2005-2006 school year, and then focused her responsibilities to full-time librarian the following fall. When not at school, Karen spends time playing with her two daughters, running long distances, and reading as much young adult fiction as possible.", "<i>“My favorite part about working at Eastside Prep is the people. The teachers, staff, and administrators are energetic, mindful, dedicated, fun-loving and intellectually engaging. The students are curious, bright, diverse and involved.”</i>"], "name": "karen_mills"}, {"bio": ["Kelly joined Eastside Prep in 2009 in a role that has changed and grown along with EPS.  What hasn’t changed is Kelly’s dedication to providing support to our students.  As the Director of Student Support Services, Kelly is our school counselor and oversees the learning support program, including Guided Study Hall,  a program she, along with her colleagues in learning support, created at EPS.  She also teaches social emotional curriculum to students in the Middle School and teaches a psychology class to Upper School students.  Kelly leads parenting discussion groups and has an open door policy for students and parents seeking advice.  Kelly has worked with adolescents and families for over twenty years in schools, in-patient psychiatric hospitals, and in private practice.  She lives in Seattle with her two children, Conor and Elizabeth and husband, Gary."], "name": "kelly_moore"}, {"bio": ["Jack came to EPS in 2008 and quickly worked to ensure that Eastside Prep’s many tech components run smoothly.  Prior to becoming the go-to guy for tech issues for both students and staff at EPS, Jack taught all levels in kindergarten through twelfth grade in the Seattle area.  Jack is an avid cyclist and birder.  He also enjoys spending time with his family.", "<i>“The best aspect of my job is that I know every single kid and they know me.  It’s great!”</i>"], "name": "jack_nolan"}, {"bio": [], "name": "todd_nystrom"}, {"bio": ["Elena joined EPS in 2006 after nine years of teaching at the University of Washington. In addition to teaching Upper School English and writers’ workshops, Elena is also one of our four college counselors. Elena is a tireless advocate for differentiated instruction and with Sam Uzwack has co-pioneered two experiential education courses in the Upper School, Experience: Seattle and Experience: Arches National Park. Elena loves hiking the Cascades and Olympics, traveling to sunny beaches, writing poetry, and cooking for family and friends.", "<i>“I am so proud to tell people that I teach at Eastside Prep. I teach students who bring a wide variety of talents and learning styles to my classroom and am excited to walk into that room every day, knowing they will inspire me.”</i>"], "name": "elena_olsen"}, {"bio": [], "name": "jim_owen"}, {"bio": ["Janelle moved to the Seattle area from Los Angeles in 2004 and came to Eastside Prep during the 2007-2008 school year. She brings a diverse accounting background to our school which includes television production accounting, financial planning, not-for-profit, and private trust and estate accounting. When Janelle isn’t attending to the daily accounting needs of EPS including tuition billing, she can usually be found having fun with her daughter. She also enjoys a good book, a quiet hike and a noisy, happy kitchen to cook in.", "<i>“Working at EPS isn’t just a regular job; I am part of a community. The benefits of support and camaraderie I receive from working here far outstrip a job with just a paycheck.”</i>"], "name": "janelle_panday"}, {"bio": ["Channon (Chan for short) joined Eastside Prep for the 2015-2016 school year bringing with him a wide range of film and video production experience allowing him to fill a variety of roles at the school. He spent the past decade working professionally as a cinematographer, director, editor and producer in Canada with his adventures taking him all over the country with brief stints overseas as well in Denmark and Uganda.", "In addition to motion pictures, he’s an avid photographer focusing mainly on landscape and fine-art as well as portraiture for actors. He’s also an avid volleyball player and competed for years before filling various coaching positions. This has led him to take over coaching responsibilities with the US volleyball team this year as well.", "Chan is married with four kids between the ages of one and ten. He loves games – especially nerdy ones like D&#038;D and MTG – and watches movies incessantly."], "name": "chan_pedersen"}, {"bio": ["As a Learning Support intern, Andre will be co-teaching an Upper School elective with Dr. Kelly Moore and will also be covering for Jess Claesson while she is away on maternity leave. After graduating from Pomona College with a bachelor’s degree in neuroscience, Andre has worked as a science teacher, soccer coach, and most recently at the Pacific Science Center’s summer program. Andre looks forward to teaching kids to have the skills and confidence to meet whatever demands come their way.", "In his free time, Andre plays board games and runs a monthly comedy show called “Wallingford Laughs.”", "<i>“The tight-knit community feel and the commitment to a positive learning environment made me feel right at home when I visited EPS.”</i>"], "name": "andre_pegeron"}, {"bio": ["Prior to joining EPS in 2011, Randi-Louise lived in both Vancouver, B.C. and the Yukon Territory working in the arts and entertainment industry for music festivals, arts centers and record labels. She has a passion for Celtic fiddle music and going on various outdoor adventures with her husband."], "name": "randi-louise_peterson"}, {"bio": ["Before moving to Seattle in 2008, Kirsten (KP) taught at the Landon School in Bethesda, MD and at Noble and Greenough School in Dedham, MA where she also coached soccer and rowing and worked with the Outdoor Club. Before becoming a teacher, she served in the Peace Corps in West Africa. Outside of school, KP’s interests include travel, rock climbing, cooking, anything outdoors, and spending time with her husband and her two daughters. She has led backpacking trips in Washington State, Utah, California, and New Hampshire; kayaking trips in the San Juans and in Baja, Mexico; and service trips in Costa Rica and South Africa. At Eastside Prep, KP works with the Spoken Word Poetry Club, the outdoor program, and the climbing club.", "<i>“I love teaching at EPS. We work in an atmosphere of constant reevaluation and reinvention as faculty push themselves to challenge students in the realm of critical thinking and collaboration. We are a community to the core, from staff to students, and we relish our time together in the classroom and beyond.”</i>"], "name": "kirsten_pike"}, {"bio": [], "name": "gilbert_ragudos"}, {"bio": ["Sarah discovered EPS at the 2012 <em>Finding Kind</em> event at the <em>Kirkland Performing Arts Center</em>. After sitting in awe of the school community before her, she turned to her husband and said with certainty, “Someday I am going to work here.” He now knows that when she says something so certain, it’s probably going to happen—for her number one strength on the Gallop Poll Strengths Test (a personality test that all members of the EPS community participate) is <em>Activation</em>. Throughout her career she has <em>activated</em> in many endeavors that widen her scope of the traditional classroom paradigm. She has been involved in teaching abroad programs, in both Lima, Peru, and Gulu, Uganda. Sarah has taken a number of international trips with students such as China and Vietnam, and to Europe with the People to People Student Ambassador Program. She spent a number of years as a debate team coach–so be prepared–stepping into her classroom is often stepping into a rich dialogue. Two years ago, Sarah moved onto a sailboat with her husband. They spent last year learning how to sail and recently completed a circumnavigation of Orcas Island&#8211; although not a very dangerous trek for most sailors, she is happy to have made it back alive! On this particular voyage she and her husband participated in a teacher training course in Port Townsend called <em>Theatre of the Oppressed</em>. She incorporates these strategies that she says, “Flip the paradigm of teaching on its head,” for she believes creating curriculum and lessons that are meaningful and personal is the only way the world will move in a more positive direction. With the addition of her new baby girl, Sarah and her husband recently moved off their sail boat to a little town called Carnation. They are enjoying being parents and have a whole new appreciation for the parents of the students they teach. For that reason, she is so happy to be a part of the greater EPS family."], "name": "sarah_rainwater"}, {"bio": ["Tracy joined Eastside Prep in 2012 after moving to the Seattle area from Ohio with her husband and two daughters.  Tracy’s prior experience includes work in the insurance industry as both a supervisor of a team of 19 at a claims call center and as a business analyst for two senior leaders.  If you visit Tracy in her office you will see that she loves cupcakes! The Middle School students love to add their own cupcake artwork to her collection.", "<i>“The one thing I love about EPS is the people! Everyone here really cares about the students, their jobs, and the people they work with. I see examples of it every day and it truly makes EPS special.”</i>"], "name": "tracy_ritter"}, {"bio": ["Jim joined Eastside Prep to oversee the non-academic areas of the school. His focus is on finance, accounting, buildings and grounds, foodservices, and any other support and services necessary to provide an enriched learning experience. He will also be working closely with other senior staff on long-range strategic planning. Jim comes to EPS with over fifteen years of experience in various roles such as CFO, COO, and CEO at a variety of non-profit and for-profit organizations.", "Jim has two grown sons ages twenty-four and twenty-two. He loves basketball and can’t wait for the new athletic center. He’s also interested in boating and astronomy."], "name": "jim_rensberger"}, {"bio": ["Josefa has been involved in education since she began tutoring at the age of fourteen.  After receiving her B.S. from the University of Murcia in Spain, she taught Business Administration there for fifteen years.  Josefa decided to combine her passion for teaching with her love of the Spanish language soon after her first child was born.  She even started a cooperative preschool where the objective is for students to be bilingual in Spanish and English.  Josefa was drawn to Eastside Prep in 2014 because the Spanish language is taken beyond the classroom.  She conducts her classes almost exclusively in Spanish with a focus on oral proficiency.  Josefa also likes to incorporate American Sign Language and storytelling into her classes.  When not teaching, Josefa enjoys biking and rollerblading with her husband and two children."], "name": "josefa_ruiz"}, {"bio": ["Ana has had many roles at Eastside Prep since 2008.  She began as the Middle School Assistant and quickly moved to a role as the Student Life Coordinator.  In that position, Ana worked with the Dean of Students Office, Athletics and Admissions teams to promote all student life outside of the classroom. From there, Ana made her way to the office of Institutional Advancement where she helped organize community events and worked on the annual fund. This year, Ana will support the Academic Dean’s office and will also spend more time with students through her role as After-School Study Supervisor. Prior to joining Eastside Prep in 2008, Ana worked as an event specialist where she planned numerous weddings, corporate events and private parties.", "<i>“The feeling of community at Eastside Prep is tangible and one that I am excited to be a part of. It is a joy to watch students and parents walk into EPS at the beginning of the year as a new community member and within days you can see that it feels like they have been here for years. I am proud to be a part of a school that believes in the students and understands the importance of communication between parents, faculty and students.”</i>"], "name": "ana_safavi"}, {"bio": ["Roz joined EPS for the 2014-2015 school year after having spent several years teaching Spanish in public and independent schools. Teaching is a new adventure for Roz, after spending thirty years working in marketing and sales for Fortune 500 companies, mostly on an international level. That business experience showed Roz that being able to communicate in a foreign language was key to being effective in business and it also taught her to appreciate and fully engage with global communities. Roz is excited to share her cross-cultural experiences with students at Eastside Prep. Teaching Spanish to Middle School students and raising their global consciousness is Roz’s way of giving back to the community. Roz is no stranger to EPS – she has taught here before as a long term substitute teacher and her son is a member of the Class of 2017. In her spare time, Roz enjoys making greeting cards, or going for a walk, run or hike. She competed in her first half-marathon in June 2014."], "name": "roz_sobel"}, {"bio": ["Jeff began his career at Washington Mutual Bank as a Management Trainee when the company had less than 1,000 employees and left the company as a Branch Manager and Vice President, with the company employing more than 55,000 people. He was a founding member and part owner of the Legacy Group, and served as Vice President and Director of Corporate Development and is responsible for the overall management and direct oversight of the Facilities, IT, Marketing and Human Resources departments. After years spent in the Eastside Prep community in several different capacities (including the parent of three current students), Jeff is happy to be the first impression for guests arriving at Eastside Prep. As a long time parent and former trustee, Jeff is a great person to answer questions!"], "name": "jeff_sternitzky"}, {"bio": ["Lurline has taught every subject and a wide variety of grade levels. In the process, she discovered her love for building mathematical understanding and for working with middle-schoolers. Her teaching experience ranges from a school in a farm setting to an orthodox Jewish school. Lurline likes to find connections when she teaches, which is how she builds understanding in the classroom. “I teach how fractions fit with division, how algebra fits with arithmetic. There are always new levels of connections to find and explore.” Outside of teaching, she plays the violin and cello and rides her bike, sometimes a long way (such as across the continental US with a group of high schoolers!). She also backpacks, hikes, and cross-country skis. Her newest pursuit is training to do a triathlon. And she reads, which you would know if you met her cats, James and Joyce."], "name": "lurline_sweet"}, {"bio": [], "name": "adam_szlendak"}, {"bio": ["Tom teaches drama classes in the Middle and Upper Schools and directs two of the school’s three theatrical productions. Tom has a degree in Theatre Studies from Boston University and comes with an impressive array of experience, including over fourteen years of teaching in independent schools, two years working at the Heart of America Shakespeare Festival, eighteen months performing in “Shear Madness” in Kansas City, experience as on-air talent for KISW’s Twisted Radio program, and two years working at the Orlando Shakespeare Theater.<br />\nTom is married with two boys, ages fifteen and nineteen, and two dogs. He loves hiking with his family, playing music with his youngest son and discussing film and politics with his oldest son.", "<i>“Being able to work at a school that allows experimentation is exciting to me and shows that EPS is on the cutting edge of education.”</i>"], "name": "tom_taylor"}, {"bio": ["Tobias joined Eastside Prep from the pursuit of a Phd in Environmental Economics. His passion for science, experiential education, and all things outdoors have driven everything he does at EPS since he joined in spring 2011.  Prior to working at EPS he worked as a fly-fishing guide in Alaska and as a financial analyst in Boston. Outside of school he is an avid mountaineer, cook, and field mycologist.", "In the 2015-2016 school year he will coach MS Boys Soccer and take students hiking and climbing in the Cascades.", "“There is a mutually beneficial relationship between students and teachers at EPS whereby everyone is excited about learning.  Because teachers love teaching students are more engaged with the material, which makes teaching here really fun.”  "], "name": "tobias_tillemans"}, {"bio": ["For seven years, Sam taught seventh-grade humanities at The Northwest School in Seattle, where he also co-coordinated the Outdoor Program, served as chair of the Professional Development Committee, and coached soccer and Ultimate Frisbee. His first teaching position was in an Inupiaq Eskimo Village in arctic Alaska, where he taught Middle School social studies and reading. Sam has been Middle School Head since 2009.   In that time, Sam has instituted the Middle School laptop program and added regular grade level parent talks to the schedule to increase communication between the school and parents.  He worked with Dr. Kelly Moore, our Director of Student Support Services, to bring a social emotional curriculum to the Middle School and expanded Middle School Technology offerings to include MAKE, BOTZ, and WEB.  Sam strives each day to model the three keys to success in the Middle School: Be Kind.  Work Hard.  Take Pride. He enjoys cycling, climbing, back country skiing, and backpacking, as well as leading trips for the Outdoor Club.", "<i>“The energy at Eastside Prep is infectious. Around every corner, you’ll find people engaged…students planning a fundraiser, teachers working together to plan an integrated lesson, advisors and advisees talking about their days. At EPS, folks care deeply about what they do and what they learn.”</i>"], "name": "sam_uzwack"}, {"bio": ["Kelly is a Seattle native who developed a love of Spanish over the course of many years of study, beginning in the 6th grade.  Her passion for language is rooted in a deep commitment to exploring and learning from other cultures around the world. She has lived abroad for a year each in Spain (where she spent her junior year of college) and Puerto Rico (where she worked as a rainforest adventure guide), and has traveled to many countries in Latin America.  Kelly began teaching Spanish at Eastside Prep in 2009 and since then she has led EBC travel experiences to Ecuador, Cuba, and Nicaragua, enjoying once-in-a-lifetime experiences such as swimming with a raft of sea lions in the Galapagos and hitting a line drive to center field against a team of ten year olds in Lattabana.  In 2013, Kelly launched a YouTube channel (<a href=\"http://bit.ly/ProfesoraFox\" target=\"_blank\">http://bit.ly/ProfesoraFox</a>) featuring Spanish Grammar Music Videos, which have quickly become a student favorite.  In her free time, Kelly loves to play in the mountains, especially long distance trail running, backpacking, climbing, and swimming in alpine lakes.  She fervently believes that any challenge can be overcome with enough dark chocolate.", "<i>“The Spanish curriculum is so fully integrated into the life of Eastside Prep. There are ways that we can include the language in every corner of the school: in bilingual posters representing the school’s 5 Respect Points, in students who raise their hands in science class and ask their question in Spanish, in a school-wide celebration of the Día de los muertos. It’s a unique set-up for a school and one that I believe enriches the foreign language experience for every student.”</i>"], "name": "kelly_violette"}, {"bio": ["Nickie teaches Upper School Chemistry and Advanced Chemistry. She has taught in the classroom and in the outdoors, on Orcas Island, in Chattanooga, Tennessee, and in Cape Town, South Africa. In Cape Town, she taught Chemistry and Physics at an all-girls independent school for eleven years. She also coordinated outdoor and international excursions for the students there, experience she is excited to bring to the Eastside Prep community through trips and the outdoor club.", "Nickie is excited to be part of a community as creative as EPS. She and her wife moved to Seattle in March from Cape Town with their dog, Beebee.", "<i>“There were a number of factors that drew me to EPS, but the most exciting aspect for me is the freedom that teachers are given to be creative, critical and innovative about the curriculum in their classrooms.“</i>"], "name": "nicole_wallace"}, {"bio": ["Adam joined the Eastside Prep faculty in 2006 and teaches science in the Upper School.  He also enjoys coaching the EPS Ultimate Frisbee team. Adam has twenty years of teaching experience at Mercer Island High School, The Osaka School of Music, and the Berlitz School in Ashiya, Japan.", "<i>“The embrace of interdisciplinary learning and integrated curriculum at EPS has allowed me to connect the work we do in a science classroom to other academic courses and students’ lives. The close relationships I have with my colleagues makes it easy to share parts of my curriculum and incorporate theirs.”</i>"], "name": "adam_waltzer"}, {"bio": ["Kip grew up in Montana right by Flathead Lake, Glacier National Park and Big Mountain Ski Resort. This instilled a love of the outdoors and nature, travel and anything that presents challenge. He has continued this as he commutes to work on his bike every day, pursues a quest to climb the highest mountain in all 50 states, and international travel. His favorite way to travel is with someone local who can show him the real experience not often found by the tourist. Kip’s first son Blake was born in 2011 and second son Markus was born in 2013 so recent interests have been revised to include trips to the zoo, science center, aquarium and summers at the lake. Before joining the EPS faculty, Kip taught science for six years in Idaho and New York, spent two years working as a Dean of Students and utilized his teaching experience as an Education Consultant, Entrepreneur and Education Tutor and Mentor."], "name": "kip_wassink"}, {"bio": ["Brittany joined EPS in 2013 and since then has held several different roles. She spent her first year learning the ins and outs of a school through her work assisting both the Academic Dean and the Dean of Students. In that role, Brittany supported Professional Development, College Counseling and the Course Catalog. She also helped plan assemblies, social events, the EPSummer Program, and all aspects of the Education Beyond the Classroom (EBC) experiences. Most recently she continued to support EBC, while also joining the Institutional Advancement team. Starting the 2015 school year, she will solely focus her time and efforts towards events and building community in the IA department. Brittany is looking forward to becoming even more involved with the Parent Association, alumni, and fundraising goals. Prior to joining EPS, she worked in the event industry in both sales and planning numerous weddings, corporate events and private parties.", "<i>“I didn’t quite know what to expect when joining EPS since I had not previously worked in a school, but I’ve been blown away by the amazing community that is EPS! It is truly inspiring to be in an environment where everyone; students, faculty, staff and parents all care so much about their role within the school and the differences we can make.”</i>"], "name": "brittany_williams"}, {"bio": ["Cassidy joins EPS to take on a role that’s new to the school – Administrative Assistant for Athletics. Cassidy is thrilled to be working with young athletes and is excited to bring her passion and enthusiasm about all sports to the athletic program at EPS. Soccer, basketball and rowing hold a special place in her heart, as does cheerleading (an interest discovered after being sidelined in high school by a torn ACL).", "<i>“I really wanted to find a school that valued hard work, dedication and a positive team culture. EPS offers not only these qualities, but so much more.”</i>"], "name": "cassidy_will"}, {"bio": ["For years, Ryan served as a preferred substitute teacher and worked full time during the 2012-2013 school year in a temporary position teaching English. In 2014 Ryan joined EPS full time, teaching Historical Thinking in the Middle School.  Ryan is excited to be a part of the Eastside Prep community again because, as he says, “I love this school.  There is nowhere else where the staff invests as much time and energy into thoughtfully constructing an education that will help students in both life and their future employment.”  When not in the classroom, Ryan can be found on the sports field.  He loves coaching Ultimate Frisbee teams.  When not hanging out with his wife and young daughters, Ryan enjoys yard work, working on his house and reading historical books and biographies.", "<i>“My goal is to provide a solid structure and framework for students to explore the amazing stories and civilization that we find throughout the world.  I want my curriculum to intellectually and emotionally engage my students, so much so that their parents want to be a part of their learning.”</i>"], "name": "ryan_winkelmann"}, {"bio": [], "name": "david_winspear"}, {"bio": ["<i>“When I first saw the values of EPS my heart was jumping with joy. I had imagined myself in such an environment and felt my mind opened a touch more. Learning is a lifelong project!”</i>"], "name": "marcela_winspear"}, {"bio": ["Dan will be providing some continuity as a full time substitute teacher for the 2015-2016 school year as well as filling in for Kirsten Pike while she is away on maternity leave in the fall. Dan&#8217;s background is varied – he&#8217;s been a teacher-naturalist at a science camp and worked on an archaeological dig in Athens before teaching at an independent school in the Bay Area for twelve years.", "Dan has a thing for dead languages, especially ancient Greek and Latin, which he&#8217;s been studying since he was knee high to a centurion. He once spent a summer in Rome reading really old texts with the Pope&#8217;s Latinist. In his free time he enjoys riding bikes, messing around in the garage, and building stuff with his six year-old son.", "<i>&#8220;I was looking for a new adventure when I found Eastside Prep. The relative newness of the school, its size, and values attracted me.&#8221;</i>"], "name": "dan_yezbick"}]